{
    "missions": [
      {
        "id": 0,
        "category": "Focus Mode",
        "description": "Complete a 30-minute study session without any distractions."
      },
      {
        "id": 1,
        "category": "Focus Mode",
        "description": "Use the Focus Mode for 1 hour while studying for a difficult exam."
      },
      {
        "id": 2,
        "category": "Focus Mode",
        "description": "Study for 2 hours without checking social media or email."
      },
      {
        "id": 3,
        "category": "Focus Mode",
        "description": "Complete 3 study sessions of at least 45 minutes each with the Focus Mode on."
      },
      {
        "id": 4,
        "category": "Focus Mode",
        "description": "Use the Focus Mode to study for an entire afternoon (4 hours)."
      },
      {
        "id": 5,
        "category": "Focus Mode",
        "description": "Study without any distractions for an entire day (8 hours) using the Focus Mode."
      },
      {
        "id": 6,
        "category": "Focus Mode",
        "description": "Use the Focus Mode to study during a long commute (e.g., 1-hour train ride)."
      },
      {
        "id": 7,
        "category": "Focus Mode",
        "description": "Complete a timed quiz using the Focus Mode and score at least 90%."
      },
      {
        "id": 8,
        "category": "Focus Mode",
        "description": "Use the Focus Mode to study for a subject you find difficult for 2 hours."
      },
      {
        "id": 9,
        "category": "Focus Mode",
        "description": "Use the Focus Mode to study for a subject you enjoy for 3 hours."
      },
      {
        "id": 10,
        "category": "Notes",
        "description": "Take notes during a lecture and review them later."
      },
      {
        "id": 11,
        "category": "Notes",
        "description": "Organize your notes for a difficult class by creating headings and subheadings."
      },
      {
        "id": 12,
        "category": "Notes",
        "description": "Use different colors and fonts to make your notes more visually appealing."
      },
      {
        "id": 13,
        "category": "Notes",
        "description": "Create a mind map or concept map for a topic covered in class."
      },
      {
        "id": 14,
        "category": "Notes",
        "description": "Take notes while reading a difficult chapter in a textbook."
      },
      {
        "id": 15,
        "category": "Notes",
        "description": "Create flashcards based on your notes for a quiz or exam."
      },
      {
        "id": 16,
        "category": "Notes",
        "description": "Share your notes with a study group or classmate."
      },
      {
        "id": 17,
        "category": "Notes",
        "description": "Use your notes to write a summary of a class lecture or reading."
      },
      {
        "id": 18,
        "category": "Notes",
        "description": "Review and revise your notes after receiving feedback from a teacher or tutor."
      },
      {
        "id": 19,
        "category": "Notes",
        "description": "Use your notes to create a study guide for an upcoming exam."
      },
      {
        "id": 20,
        "category": "Community (Article Writing)",
        "description": "Write an article on a topic related to a subject you're studying."
      },
      {
        "id": 21,
        "category": "Community (Article Writing)",
        "description": "Interview a teacher or expert in a field and write an article based on the interview."
      },
      {
        "id": 22,
        "category": "Community (Article Writing)",
        "description": "Research a current event and write an article about how it relates to a subject you're studying."
      },
      {
        "id": 23,
        "category": "Community (Article Writing)",
        "description": "Write a review of a book or article you read for a class."
      },
      {
        "id": 24,
        "category": "Community (Article Writing)",
        "description": "Write an article on a topic that you're passionate about, even if it's not directly related to a class."
      },
      {
        "id": 25,
        "category": "Community (Article Writing)",
        "description": "Write an article on a topic that challenges your beliefs or assumptions."
      },
      {
        "id": 26,
        "category": "Community (Article Writing)",
        "description": "Write an article about a historical event and its impact on society today."
      },
      {
        "id": 27,
        "category": "Community (Article Writing)",
        "description": "Write an article about a problem in your community and potential solutions."
      },
      {
        "id": 28,
        "category": "Community (Article Writing)",
        "description": "Write an article about a career or industry you're interested in pursuing."
      },
      {
        "id": 29,
        "category": "Community (Article Writing)",
        "description": "Write an article comparing and contrasting different cultural practices or traditions."
      },
      {
        "id": 30,
        "category": "AI",
        "description": "Use AI to create a quiz or game for a topic you're studying."
      },
      {
        "id": 31,
        "category": "AI",
        "description": "Research the history of AI and write a brief summary."
      },
      {
        "id": 32,
        "category": "AI",
        "description": "Use AI to generate summaries of articles or textbooks you're reading."
      },
      {
        "id": 33,
        "category": "AI",
        "description": "Use AI to transcribe a lecture or podcast and review the transcript."
      },
      {
        "id": 34,
        "category": "AI",
        "description": "Use AI to create flashcards based on a topic you're studying."
      },
      {
        "id": 35,
        "category": "AI",
        "description": "Use AI to analyze data for a research project."
      },
      {
        "id": 36,
        "category": "AI",
        "description": "Use AI to identify patterns in a set of data."
      },
      {
        "id": 37,
        "category": "AI",
        "description": "Use AI to translate text from one language to another."
      },
      {
        "id": 38,
        "category": "AI",
        "description": "Use AI to identify similarities and differences between two sets of data."
      },
      {
        "id": 39,
        "category": "AI",
        "description": "Use AI to predict the outcome of an experiment or study."
      },
      {
        "id": 40,
        "category": "Chat Forum",
        "description": "Participate in a chat forum discussion about a topic covered in class."
      },
      {
        "id": 41,
        "category": "Chat Forum",
        "description": "Share an article or video related to a subject and start a discussion about it."
      },
      {
        "id": 42,
        "category": "Chat Forum",
        "description": "Ask a question in a chat forum about a concept you're having trouble understanding."
      },
      {
        "id": 43,
        "category": "Chat Forum",
        "description": "Provide feedback to a classmate or group member on a project or assignment."
      },
      {
        "id": 44,
        "category": "Chat Forum",
        "description": "Participate in a chat forum debate on a controversial topic."
      },
      {
        "id": 45,
        "category": "Chat Forum",
        "description": "Offer suggestions to a classmate who is struggling with a difficult assignment."
      },
      {
        "id": 46,
        "category": "Chat Forum",
        "description": "Share your own experiences or insights related to a topic being discussed in the chat forum."
      },
      {
        "id": 47,
        "category": "Chat Forum",
        "description": "Collaborate with other students in the chat forum to create a study group or project team."
      },
      {
        "id": 48,
        "category": "Chat Forum",
        "description": "Use the chat forum to brainstorm ideas for a research project or presentation."
      },
      {
        "id": 49,
        "category": "Chat Forum",
        "description": "Use the chat forum to connect with other students who share similar interests or career goals."
      }
    ]
  }