[
    {
        "Chapter": "Physical World (Class 11 NCERT Physics)",
        "Topics": [
          {
            "Topic": "Introduction to Physics",
            "Definition": "The study of fundamental principles governing the behavior of matter and energy in the universe."
          },
          {
            "Topic": "Scope and Excitement of Physics",
            "Definition": "Physics explores the laws of nature, from the smallest particles to the vast cosmos."
          },
          {
            "Topic": "Physics, Technology, and Society",
            "Definition": "Physics advancements contribute to technological innovation and shape society."
          },
          {
            "Topic": "Fundamental Forces in Nature",
            "Definition": "Four fundamental forces: gravitational, electromagnetic, weak nuclear, and strong nuclear forces."
          },
          {
            "Topic": "Nature of Physical Laws",
            "Definition": "Physical laws are concise statements describing natural phenomena and predicting outcomes."
          },
          {
            "Topic": "Theory and Experiment",
            "Definition": "Theoretical physics develops models, experimental physics tests them; interdependence of theory and experiment."
          },
          {
            "Topic": "Units and Measurements",
            "Definition": "Standard units for physical quantities; systems of units - CGS, MKS, SI."
          },
          {
            "Topic": "Length, Mass, and Time Measurements",
            "Definition": "Measurement standards for length (meter), mass (kilogram), and time (second)."
          },
          {
            "Topic": "Accuracy, Precision, Errors in Measurement",
            "Definition": "Accuracy (closeness to true value), precision (reproducibility), types of errors."
          },
          {
            "Topic": "Significant Figures",
            "Definition": "Digits used to express a measurement's precision; rules for counting significant figures."
          },
          {
            "Topic": "Dimensions of Physical Quantities",
            "Definition": "Dimensions (exponents) of fundamental quantities in equations; dimensional analysis."
          },
          {
            "Topic": "Conversion of Units",
            "Definition": "Conversion between different units using conversion factors."
          },
          {
            "Topic": "Measurement of Length",
            "Definition": "Instruments like Vernier calipers and screw gauge; least count, zero error."
          },
          {
            "Topic": "Measurement of Mass and Time",
            "Definition": "Balance for mass, pendulum for time; periodic and simple harmonic motion."
          }
        ]
      },
      {
        "Chapter": "Units and Measurements (Class 11 NCERT Physics)",
        "Topics": [
          {
            "Topic": "Introduction to Units",
            "Definition": "Measurement is the comparison of an unknown quantity with a standard unit."
          },
          {
            "Topic": "Systems of Units",
            "Definition": "Different systems like CGS, MKS, and SI; advantages of using SI system."
          },
          {
            "Topic": "SI Units and Fundamental Units",
            "Definition": "Seven base SI units: meter, kilogram, second, ampere, kelvin, mole, candela."
          },
          {
            "Topic": "Derived Units",
            "Definition": "Units obtained from base units through multiplication or division; examples."
          },
          {
            "Topic": "Length, Mass, and Time",
            "Definition": "Definition and standard units for length, mass, and time in SI system."
          },
          {
            "Topic": "Length Measurement",
            "Definition": "Measuring instruments like vernier calipers, screw gauge, and micrometer; least count."
          },
          {
            "Topic": "Mass Measurement",
            "Definition": "Methods of measuring mass; balance, beam balance, electronic balance."
          },
          {
            "Topic": "Errors in Measurement",
            "Definition": "Systematic and random errors; absolute and relative error; error analysis."
          },
          {
            "Topic": "Significant Figures",
            "Definition": "Rules for determining significant figures; calculations involving significant figures."
          },
          {
            "Topic": "Dimensions of Physical Quantities",
            "Definition": "Dimensional formula, dimension of length, time, mass, velocity, acceleration."
          },
          {
            "Topic": "Dimensional Analysis and Applications",
            "Definition": "Checking correctness of equations, converting units, obtaining dimensionless ratios."
          },
          {
            "Topic": "Dimensional Equations",
            "Definition": "Equations representing physical quantities in terms of fundamental dimensions."
          },
          {
            "Topic": "Dimensionless Equations",
            "Definition": "Equations without dimensions, used in pure number form."
          },
          {
            "Topic": "Measurement of Mass and Time",
            "Definition": "Accuracy and precision in measurements, estimation of error."
          },
          {
            "Topic": "Measuring Instruments",
            "Definition": "Principles of operation and use of measuring instruments."
          }
        ]
      },
      {
        "Chapter": "Motion in a Straight Line (Class 11 NCERT Physics)",
        "Topics": [
          {
            "Topic": "Introduction to Motion",
            "Definition": "Change in position of an object with time; scalar and vector quantities."
          },
          {
            "Topic": "Types of Motion",
            "Definition": "Rectilinear motion along a straight line, curvilinear motion along a curve."
          },
          {
            "Topic": "Position, Path Length, and Displacement",
            "Definition": "Position vector, path length, displacement vector; relation between displacement and path length."
          },
          {
            "Topic": "Average and Instantaneous Velocity",
            "Definition": "Average velocity over an interval, instantaneous velocity at a specific point."
          },
          {
            "Topic": "Acceleration",
            "Definition": "Rate of change of velocity; average and instantaneous acceleration."
          },
          {
            "Topic": "Equations of Motion",
            "Definition": "Deriving equations for uniformly accelerated motion; first, second, and third equations."
          },
          {
            "Topic": "Uniformly Accelerated Motion",
            "Definition": "Motion with constant acceleration; equations for velocity, displacement, and time."
          },
          {
            "Topic": "Acceleration due to Gravity",
            "Definition": "Free fall motion under gravity; acceleration due to gravity near the Earth's surface."
          },
          {
            "Topic": "Motion under Gravity",
            "Definition": "Vertical motion of objects thrown upwards or dropped downwards; time of flight, maximum height."
          },
          {
            "Topic": "Graphical Representation of Motion",
            "Definition": "Position-time graph, velocity-time graph, acceleration-time graph."
          },
          {
            "Topic": "Equations of Motion from Graphs",
            "Definition": "Deriving equations of motion from graphical representation."
          },
          {
            "Topic": "Relative Velocity",
            "Definition": "Velocity of one object as observed from another moving object; vector addition of velocities."
          },
          {
            "Topic": "Projectile Motion",
            "Definition": "Motion of an object projected at an angle to the horizontal; horizontal and vertical motions."
          },
          {
            "Topic": "Uniform Circular Motion",
            "Definition": "Motion along a circular path with constant speed; centripetal and centrifugal forces."
          },
          {
            "Topic": "Scalar and Vector Quantities",
            "Definition": "Scalar quantities have only magnitude, vector quantities have magnitude and direction."
          }
        ]
      },
      {
        "Chapter": "Motion in a Plane (Class 11 NCERT Physics)",
        "Topics": [
          {
            "Topic": "Introduction to Motion in a Plane",
            "Definition": "Motion in two dimensions; vector representation of quantities."
          },
          {
            "Topic": "Position Vector and Displacement",
            "Definition": "Position vector, displacement, addition of vectors using graphical and component methods."
          },
          {
            "Topic": "Velocity and Acceleration in Two Dimensions",
            "Definition": "Vector forms of velocity and acceleration; projectile motion."
          },
          {
            "Topic": "Relative Velocity in Two Dimensions",
            "Definition": "Addition of velocities, vector subtraction; frame of reference."
          },
          {
            "Topic": "Uniform Circular Motion",
            "Definition": "Motion along a circular path with constant speed; centripetal and centrifugal forces."
          },
          {
            "Topic": "General Second Equation of Motion",
            "Definition": "Equation for displacement in terms of initial velocity, acceleration, and time."
          },
          {
            "Topic": "Projectile Motion",
            "Definition": "Motion of an object projected at an angle to the horizontal; horizontal and vertical motions."
          },
          {
            "Topic": "Uniform Circular Motion",
            "Definition": "Motion along a circular path with constant speed; centripetal and centrifugal forces."
          },
          {
            "Topic": "Motion in a Plane with Constant Acceleration",
            "Definition": "Equations of motion for motion with constant acceleration in two dimensions."
          }
        ]
      },{
        "Chapter": "Laws of Motion (Class 11 NCERT Physics)",
        "Topics": [
          {
            "Topic": "Introduction to Newton's Laws of Motion",
            "Definition": "First law of inertia, second law of acceleration, third law of action and reaction."
          },
          {
            "Topic": "Force and Inertia",
            "Definition": "Relation between force and acceleration; mass as measure of inertia."
          },
          {
            "Topic": "Conservation of Momentum",
            "Definition": "Law of conservation of linear momentum; collision and recoil."
          },
          {
            "Topic": "Equilibrium of a Particle",
            "Definition": "Conditions for equilibrium; types of equilibrium: stable, unstable, neutral."
          },
          {
            "Topic": "Dynamics of Uniform Circular Motion",
            "Definition": "Centripetal force, motion in a vertical circle, banking of tracks."
          },
          {
            "Topic": "Friction",
            "Definition": "Static and kinetic friction; laws of friction; rolling friction, advantages of friction."
          },
          {
            "Topic": "Dynamics of Rolling Motion",
            "Definition": "Rolling without slipping, acceleration in rolling motion; energy conservation."
          },
          {
            "Topic": "Dynamics of Circular Motion",
            "Definition": "Tension, banking of curves, non-uniform circular motion."
          }
        ]
      },
      {
        "Chapter": "Work, Energy and Power (Class 11 NCERT Physics)",
        "Topics": [
          {
            "Topic": "Introduction to Work, Energy, and Power",
            "Definition": "Concepts of work done, energy, and power; scalar and vector quantities."
          },
          {
            "Topic": "Work Done by a Constant Force",
            "Definition": "Definition of work, work done by a constant force along a straight line."
          },
          {
            "Topic": "Work Done by a Variable Force",
            "Definition": "Work done by a variable force; area under a force-displacement graph."
          },
          {
            "Topic": "Energy and its Forms",
            "Definition": "Different forms of energy: kinetic, potential, internal, gravitational."
          },
          {
            "Topic": "Work-Energy Theorem",
            "Definition": "Relation between work done by net force and change in kinetic energy."
          },
          {
            "Topic": "Power",
            "Definition": "Definition of power, its SI unit, relationship between power and work done."
          },
          {
            "Topic": "Collisions",
            "Definition": "Elastic and inelastic collisions; conservation of linear momentum."
          },
          {
            "Topic": "Explosions",
            "Definition": "Concept of explosions, change in momentum."
          },
          {
            "Topic": "Rocket Propulsion",
            "Definition": "Conservation of linear momentum in rocket propulsion; motion of a rocket."
          }
        ]
      },
      {
        "Chapter": "System of Particles and Rotational Motion (Class 11 NCERT Physics)",
        "Topics": [
          {
            "Topic": "Centre of Mass",
            "Definition": "Definition of center of mass; center of mass of a two-particle system."
          },
          {
            "Topic": "Motion of Center of Mass",
            "Definition": "Motion of center of mass of a system of particles; external and internal forces."
          },
          {
            "Topic": "Linear Momentum of System of Particles",
            "Definition": "Definition of linear momentum; conservation of linear momentum of a system."
          },
          {
            "Topic": "Angular Velocity and its Relation with Linear Velocity",
            "Definition": "Definition of angular velocity; relation between angular velocity and linear velocity."
          },
          {
            "Topic": "Torque and Angular Momentum",
            "Definition": "Torque, angular momentum, relation between torque and angular momentum."
          },
          {
            "Topic": "Equilibrium of a Rigid Body",
            "Definition": "Condition for equilibrium, rigid body in translational and rotational equilibrium."
          },
          {
            "Topic": "Moment of Inertia",
            "Definition": "Moment of inertia, radius of gyration, moment of inertia of simple geometrical shapes."
          },
          {
            "Topic": "Theorems of Perpendicular and Parallel Axes",
            "Definition": "Theorems for calculating moment of inertia using perpendicular and parallel axes."
          },
          {
            "Topic": "Kinematics of Rotational Motion",
            "Definition": "Angular displacement, angular velocity, angular acceleration."
          },
          {
            "Topic": "Dynamics of Rotational Motion",
            "Definition": "Torque, Newton's second law for rotational motion."
          }
        ]
      },
      {
        "Chapter": "Gravitation (Class 11 NCERT Physics)",
        "Topics": [
          {
            "Topic": "Introduction to Gravitation",
            "Definition": "Newton's law of gravitation; universal law of gravitation."
          },
          {
            "Topic": "Kepler's Laws",
            "Definition": "Kepler's laws of planetary motion."
          },
          {
            "Topic": "Gravitational Field",
            "Definition": "Gravitational field due to a point mass, its properties and strength."
          },
          {
            "Topic": "Acceleration due to Gravity",
            "Definition": "Acceleration due to gravity; variation of 'g' with altitude and depth."
          },
          {
            "Topic": "Gravitational Potential Energy",
            "Definition": "Gravitational potential energy, potential energy of an isolated system."
          },
          {
            "Topic": "Escape Speed",
            "Definition": "Escape speed from Earth, relation between escape speed and orbital speed."
          },
          {
            "Topic": "Earth Satellites",
            "Definition": "Orbital velocity, geostationary satellites, polar satellites."
          }
        ]
      },
      {
        "Chapter": "Mechanical Properties of Solids (Class 11 NCERT Physics)",
        "Topics": [
          {
            "Topic": "Introduction to Mechanical Properties of Solids",
            "Definition": "Introduction to elasticity, plasticity, and rigidity."
          },
          {
            "Topic": "Elastic Behaviour of Solids",
            "Definition": "Stress and strain, Hooke's law, Young's modulus."
          },
          {
            "Topic": "Stress-strain Curve",
            "Definition": "Stress-strain curve for a ductile material; yield point, breaking point."
          },
          {
            "Topic": "Factors Affecting Elastic Moduli",
            "Definition": "Factors affecting modulus of elasticity: temperature, impurities, crystal structure."
          },
          {
            "Topic": "Applications of Elastic Behaviour of Materials",
            "Definition": "Applications of elastic behavior: springs, strain gauges, rubber bands."
          },
          {
            "Topic": "Plastic Behaviour of Solids",
            "Definition": "Plastic deformation, elastic and plastic moduli, plasticity in metals."
          },
          {
            "Topic": "Stress-strain Curve for Ductile and Brittle Materials",
            "Definition": "Stress-strain curve for ductile and brittle materials; difference in behavior."
          }
        ]
      },
      {
        "Chapter": "Mechanical Properties of Fluids (Class 11 NCERT Physics)",
        "Topics": [
          {
            "Topic": "Introduction to Fluids",
            "Definition": "Introduction to fluids, distinction between solids and fluids."
          },
          {
            "Topic": "Pressure",
            "Definition": "Pressure in fluids, atmospheric pressure, pressure due to fluids at rest."
          },
          {
            "Topic": "Pascal's Law",
            "Definition": "Pascal's law and its applications in hydraulics."
          },
          {
            "Topic": "Effect of Gravity on Fluid Pressure",
            "Definition": "Pressure variation with depth in a fluid under gravity."
          },
          {
            "Topic": "Buoyancy and Floatation",
            "Definition": "Buoyant force, Archimedes' principle, floatation, submerged bodies."
          },
          {
            "Topic": "Viscosity",
            "Definition": "Viscosity of fluids, coefficient of viscosity, Stokes' law."
          },
          {
            "Topic": "Stokes' Law",
            "Definition": "Stokes' law and terminal velocity of spherical bodies in viscous fluids."
          },
          {
            "Topic": "Surface Tension",
            "Definition": "Surface tension, capillary rise, excess pressure inside a bubble or drop."
          },
          {
            "Topic": "Viscous Force",
            "Definition": "Viscous force and viscous drag, terminal velocity in viscous fluids."
          }
        ]
      },
      {
        "Chapter": "Thermal Properties of Matter (Class 11 NCERT Physics)",
        "Topics": [
          {
            "Topic": "Introduction to Thermal Properties",
            "Definition": "Temperature, heat, thermal expansion, specific heat, and heat transfer."
          },
          {
            "Topic": "Temperature and Heat",
            "Definition": "Definition of temperature, heat, internal energy; zeroth law of thermodynamics."
          },
          {
            "Topic": "Measurement of Temperature",
            "Definition": "Thermometric properties, temperature scales, mercury-in-glass thermometer."
          },
          {
            "Topic": "Thermal Expansion",
            "Definition": "Linear expansion, coefficient of linear expansion, thermal expansion of solids."
          },
          {
            "Topic": "Anomalous Expansion of Water",
            "Definition": "Anomalous expansion of water, density and temperature relationship."
          },
          {
            "Topic": "Thermal Expansion of Liquids",
            "Definition": "Volume expansion, coefficient of volume expansion, expansion of liquids."
          },
          {
            "Topic": "Thermal Expansion of Gases",
            "Definition": "Thermal expansion of gases, coefficient of volume expansion of ideal gases."
          },
          {
            "Topic": "Thermodynamics",
            "Definition": "Introduction to thermodynamics, internal energy, work done in thermodynamic processes."
          }
        ]
      },
      {
        "Chapter": "Thermodynamics (Class 11 NCERT Physics)",
        "Topics": [
          {
            "Topic": "Thermodynamic State",
            "Definition": "Thermodynamic variables, equation of state, state functions."
          },
          {
            "Topic": "Processes and Cycles",
            "Definition": "Reversible and irreversible processes, cyclic processes, heat engines."
          },
          {
            "Topic": "Zeroth Law of Thermodynamics",
            "Definition": "Statement and implications of the zeroth law of thermodynamics."
          },
          {
            "Topic": "First Law of Thermodynamics",
            "Definition": "Conservation of energy principle, work-energy theorem."
          },
          {
            "Topic": "Specific Heat Capacity",
            "Definition": "Specific heat capacity, molar specific heat capacity, specific heat at constant volume."
          },
          {
            "Topic": "Calorimetry",
            "Definition": "Measurement of heat changes, calorimeters, latent heat."
          },
          {
            "Topic": "Second Law of Thermodynamics",
            "Definition": "Statement of second law of thermodynamics, heat engines, refrigerator, efficiency."
          },
          {
            "Topic": "Reversible and Irreversible Processes",
            "Definition": "Reversible and irreversible processes, Carnot's theorem, Carnot engine."
          },
          {
            "Topic": "Carnot's Cycle",
            "Definition": "Carnot cycle, Carnot's theorem, efficiency of Carnot engine."
          }
        ]
      },
      {
        "Chapter": "Kinetic Theory (Class 11 NCERT Physics)",
        "Topics": [
          {
            "Topic": "Introduction to Kinetic Theory",
            "Definition": "Introduction to the kinetic theory of gases, macroscopic and microscopic views."
          },
          {
            "Topic": "Gas Laws",
            "Definition": "Ideal gas equation, Avogadro's hypothesis, Boyle's law, Charles' law."
          },
          {
            "Topic": "Kinetic Interpretation of Temperature",
            "Definition": "Interpretation of temperature, absolute temperature, kinetic energy."
          },
          {
            "Topic": "Behaviour of Real Gases",
            "Definition": "Deviations from ideal behavior, van der Waals equation."
          },
          {
            "Topic": "Kinetic Theory of Gases",
            "Definition": "Mean free path, collision frequency, pressure due to gases."
          },
          {
            "Topic": "Law of Equipartition of Energy",
            "Definition": "Law of equipartition of energy, degrees of freedom, specific heat capacities."
          },
          {
            "Topic": "Specific Heat Capacity of Monoatomic Gas",
            "Definition": "Specific heat capacity of a monoatomic ideal gas, translational and rotational motion."
          },
          {
            "Topic": "Specific Heat Capacity of Diatomic Gas",
            "Definition": "Specific heat capacity of a diatomic ideal gas, translational and rotational motion."
          },
          {
            "Topic": "Mean Free Path",
            "Definition": "Mean free path, relation between mean free path, pressure, and volume."
          }
        ]
      },
      {
        "Chapter": "Oscillations (Class 11 NCERT Physics)",
        "Topics": [
          {
            "Topic": "Introduction to Oscillations",
            "Definition": "Introduction to oscillatory motion, periodic motion, simple harmonic motion."
          },
          {
            "Topic": "Periodic and Oscillatory Motions",
            "Definition": "Periodic and oscillatory motions, restoring force, displacement, amplitude."
          },
          {
            "Topic": "Simple Harmonic Motion",
            "Definition": "Simple harmonic motion (SHM), displacement, amplitude, frequency, angular frequency."
          },
          {
            "Topic": "Velocity and Acceleration in SHM",
            "Definition": "Velocity and acceleration in simple harmonic motion, phase, phase constant."
          },
          {
            "Topic": "Energy in Simple Harmonic Motion",
            "Definition": "Kinetic and potential energy in SHM, total mechanical energy, energy conservation."
          },
          {
            "Topic": "Simple Pendulum",
            "Definition": "Simple pendulum, time period, dependence on length, small angle approximation."
          },
          {
            "Topic": "Damped Simple Harmonic Motion",
            "Definition": "Damped harmonic motion, logarithmic decrement, quality factor."
          },
          {
            "Topic": "Forced Oscillations and Resonance",
            "Definition": "Forced oscillations, resonance, amplitude of forced oscillations."
          },
          {
            "Topic": "Wave Motion",
            "Definition": "Introduction to wave motion, characteristics of waves, types of waves."
          }
        ]
      },
      {
        "Chapter": "Waves (Class 11 NCERT Physics)",
        "Topics": [
          {
            "Topic": "Introduction to Waves",
            "Definition": "Introduction to wave motion, characteristics of waves, types of waves."
          },
          {
            "Topic": "Transverse and Longitudinal Waves",
            "Definition": "Transverse and longitudinal waves, displacement relation in a progressive wave."
          },
          {
            "Topic": "Speed of Wave Motion",
            "Definition": "Speed of wave motion, equation of wave motion, speed of sound waves."
          },
          {
            "Topic": "Displacement Relation in a Progressive Wave",
            "Definition": "Displacement relation in a progressive wave, amplitude, wavelength, frequency."
          },
          {
            "Topic": "The Principle of Superposition of Waves",
            "Definition": "Principle of superposition of waves, constructive and destructive interference."
          },
          {
            "Topic": "Reflection of Waves",
            "Definition": "Reflection of waves, fixed and free boundary conditions, phase change."
          },
          {
            "Topic": "Beats",
            "Definition": "Beats, beat frequency, resonance, forced oscillations and resonance."
          },
          {
            "Topic": "Doppler Effect",
            "Definition": "Doppler effect, apparent change in frequency, Doppler formula."
          },
          {
            "Topic": "Polarization",
            "Definition": "Polarization of transverse waves, plane-polarized light, polaroids."
          },
          {
            "Topic": "Standing Waves",
            "Definition": "Standing waves, normal modes of vibrations, harmonics."
          }
        ]
      }
                                                                                          
]